Repository: botstmp/sportgo2
Catalog: lib/l10n/app_*.arb
Languages: ru

# selectTimer
source: Select Workout Timer
ru: Выберите тип тренировки

source: START
ru: СТАРТ

source: Start Workout
ru: Начать тренировку

source: STOP
ru: СТОП

source: PAUSE
ru: ПАУЗА

source: RESUME
ru: ПРОДОЛЖИТЬ

source: FINISH
ru: ФИНИШ

source: COMPLETE
ru: ЗАВЕРШИТЬ

source: DONE
ru: ГОТОВО

source: Back
ru: Назад

source: Yes
ru: Да

source: No
ru: Нет

source: Select
ru: Выбрать

source: Minutes
ru: Минуты

source: Seconds
ru: Секунды

source: Hours
ru: Часы

source: Round
ru: Раунд

source: Lap
ru: Отсечка

# lapTime
source: Lap
ru: Отсечка

source: Total Time
ru: Общее время

source: Remaining Time
ru: Осталось времени

source: Rest Time
ru: Время отдыха

source: REST
ru: ОТДЫХ

source: Round Duration
ru: Длительность раунда

# roundsCount
source: Number of Rounds
ru: Количество раундов

# timeFormatHint
source: hours : minutes : seconds
ru: часы : минуты : секунды

# classicTitle
source: Classic Stopwatch
ru: Классический секундомер

# classicSubtitle
source: Free-form timing
ru: Произвольная тренировка

# classicDescription
source: Simple stopwatch with lap times. Perfect for free-form workouts where you control the pace.
ru: Простой секундомер с отсечками времени. Идеально подходит для свободных тренировок, где вы сами контролируете темп.

# interval1Title
source: Interval Timer
ru: Интервальный таймер

# interval1Subtitle
source: Rounds with rest
ru: Раунды с отдыхом

# interval1Description
source: Set the number of rounds and rest time. Perfect for circuit training and interval workouts.
ru: Установите количество раундов и время отдыха. Отлично подходит для круговых тренировок и интервальных занятий.

# interval2Title
source: Fixed Round Timer
ru: Таймер с фиксированными раундами

# interval2Subtitle
source: Timed rounds + rest
ru: Время работы + отдых

# interval2Description
source: Set exact duration for both work and rest periods. Ideal for structured workouts like Tabata.
ru: Установите точную продолжительность для периодов работы и отдыха. Идеально для структурированных тренировок типа Табата.

# intensiveTitle
source: Intensive Timer
ru: Интенсивный таймер

# intensiveSubtitle
source: Push to your limit
ru: На пределе возможностей

# intensiveDescription
source: Set a time limit and see how many rounds you can complete. Great for testing your limits.
ru: Установите временной лимит и посмотрите, сколько раундов вы сможете выполнить. Отлично для проверки своих границ.

source: Intensive Workout
ru: Интенсивная тренировка

# noRestTitle
source: No Rest Rounds
ru: Раунды без отдыха

# noRestSubtitle
source: Continuous rounds
ru: Непрерывные раунды

# noRestDescription
source: Set the number of rounds without rest periods. You control when each round ends.
ru: Установите количество раундов без периодов отдыха. Вы сами контролируете, когда заканчивается каждый раунд.

# noRestRounds
source: Rounds without Rest
ru: Раунды без отдыха

# countdownTitle
source: Countdown Timer
ru: Обратный отсчет

# countdownSubtitle
source: Count down to zero
ru: Отсчет до нуля

# countdownDescription
source: Set a specific time and count down to zero. Perfect for timed challenges.
ru: Установите конкретное время и ведите обратный отсчет до нуля. Идеально для временных вызовов.

source: Enter Data
ru: Введите данные

# invalidTime
source: Please enter a valid time
ru: Введите корректное время

# confirmEnd
source: Are you sure? Data will not be saved.
ru: Вы уверены? Данные не будут сохранены.

# saveWorkoutPrompt
source: Save this workout to history?
ru: Сохранить эту тренировку в историю?

source: Workout saved!
ru: Тренировка сохранена!

source: Workout already saved
ru: Тренировка уже сохранена

source: Save Workout
ru: Сохранить тренировку

source: Share Report
ru: Поделиться отчетом

source: View History
ru: Посмотреть историю

source: Workout Report
ru: Отчет о тренировке

source: Report
ru: Отчет

source: Summary Report
ru: Сводный отчет

source: My Workout Report
ru: Мой отчет о тренировке

source: Stopwatch
ru: Секундомер

source: Pause Workout
ru: Приостановить тренировку

source: Resume Workout
ru: Возобновить тренировку

source: Finish Workout
ru: Завершить тренировку

source: Finish Round
ru: Завершить раунд

# waitingRest
source: Waiting for Rest
ru: Ожидание отдыха

source: Round {number}
ru: Раунд {number}

# roundProgress
source: Round {current} of {total}
ru: Раунд {current} из {total}

source: Version
ru: Версия

source: Developer
ru: Разработчик

source: Description
ru: Описание

source: Contacts
ru: Контакты

# aboutDescription
source: SportOn - modern CrossFit timer app with multiple workout modes. Turn your workout ON and achieve your fitness goals!
ru: SportOn - современное приложение для кроссфит тренировок с множественными режимами таймера. Включи режим тренировки и достигай своих целей!

# settingsTitle
source: Settings
ru: Настройки

source: Switch Theme
ru: Сменить тему

source: Switch Language
ru: Сменить язык

# currentTheme
source: Current Theme: {themeName}
ru: Текущая тема: {themeName}

# classicTheme
source: Classic
ru: Классическая

# darkTheme
source: Dark
ru: Темная

# oceanTheme
source: Ocean
ru: Океанская

# forrestTheme
source: Forest
ru: Лесная

# desertTheme
source: Desert
ru: Пустынная

# mochaMousseTheme
source: Mocha Mousse
ru: Мокко Мусс

source: Unknown Theme
ru: Неизвестная тема

# stopwatchTitle
source: Stopwatch
ru: Секундомер

# stopwatchDescription
source: Free-form timing with lap recording. Perfect for unrestricted workouts.
ru: Классический секундомер с возможностью отсечек времени (раундов)

# stopWorkoutQuestion
source: Stop workout?
ru: Остановить тренировку?

# stopWorkoutMessage
source: All progress will be lost
ru: Весь прогресс будет потерян

source: Continue
ru: Продолжить

source: Total workout progress
ru: Прогресс тренировки

source: Information
ru: Информация

source: Tap to pause
ru: Нажмите для паузы

source: Tap to continue
ru: Нажмите для продолжения

source: Ready to start
ru: Готов к старту

source: 🎉 Workout completed!
ru: 🎉 Тренировка завершена!

# greatJob
source: Great job! You have successfully completed the workout.
ru: Отличная работа! Вы успешно завершили тренировку.

source: Workout Information
ru: Информация о тренировке

source: Current round
ru: Текущий раунд

source: Elapsed time
ru: Прошло времени

source: Preparation
ru: Подготовка

source: Paused
ru: Пауза

source: Finished
ru: Завершено

source: Stopped
ru: Остановлен

source: Work Time
ru: Время работы

source: Work
ru: Работа

source: Total Workout Time
ru: Общее время тренировки

# roundSingular
source: round
ru: раунд

# roundPlural
source: rounds
ru: раунда

# roundPluralMany
source: rounds
ru: раундов

# roundsLabel
source: Rounds
ru: Раунды

source: Stopwatch Mode
ru: Режим секундомера

source: Lap Times
ru: Отсечки времени

# splitTime
source: Split
ru: Сплит

# noLapTimes
source: No lap times recorded yet. Tap the flag button to record lap times.
ru: Отсечки времени пока не записаны. Нажмите кнопку флага для записи отсечек.

source: Close
ru: Закрыть
